#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ayur/snowflake-demo-test/runs/run-AywZzprwEEAaXfjx

Waiting for the plan to start...

Terraform v1.9.8
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # snowflake_database.db will be created
  + resource "snowflake_database" "db" {
      + catalog                                       = (known after apply)
      + comment                                       = "Main dev database"
      + data_retention_time_in_days                   = (known after apply)
      + default_ddl_collation                         = (known after apply)
      + enable_console_output                         = (known after apply)
      + external_volume                               = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + id                                            = (known after apply)
      + log_level                                     = (known after apply)
      + max_data_extension_time_in_days               = (known after apply)
      + name                                          = "TEST_DB"
      + quoted_identifiers_ignore_case                = (known after apply)
      + replace_invalid_characters                    = (known after apply)
      + storage_serialization_policy                  = (known after apply)
      + suspend_task_after_num_failures               = (known after apply)
      + task_auto_retry_attempts                      = (known after apply)
      + trace_level                                   = (known after apply)
      + user_task_managed_initial_warehouse_size      = (known after apply)
      + user_task_minimum_trigger_interval_in_seconds = (known after apply)
      + user_task_timeout_ms                          = (known after apply)
    }

  # snowflake_grant_account_role.grants will be created
  + resource "snowflake_grant_account_role" "grants" {
      + id        = (known after apply)
      + role_name = "TEST_ROLE"
      + user_name = "VISEO"
    }

  # snowflake_grant_privileges_to_account_role.database_grant will be created
  + resource "snowflake_grant_privileges_to_account_role" "database_grant" {
      + account_role_name = "TEST_ROLE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "USAGE",
        ]
      + with_grant_option = false

      + on_account_object {
          + object_name = "TEST_DB"
          + object_type = "DATABASE"
        }
    }

  # snowflake_grant_privileges_to_account_role.schema_grant will be created
  + resource "snowflake_grant_privileges_to_account_role" "schema_grant" {
      + account_role_name = "TEST_ROLE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "USAGE",
        ]
      + with_grant_option = false

      + on_schema {
          + schema_name = "\"TEST_DB\".\"STAGING\""
        }
    }

  # snowflake_grant_privileges_to_account_role.schema_grant1 will be created
  + resource "snowflake_grant_privileges_to_account_role" "schema_grant1" {
      + account_role_name = "TEST_ROLE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "USAGE",
        ]
      + with_grant_option = false

      + on_schema {
          + schema_name = "\"TEST_DB\".\"RAW_DTV\""
        }
    }

  # snowflake_grant_privileges_to_account_role.schema_grant2 will be created
  + resource "snowflake_grant_privileges_to_account_role" "schema_grant2" {
      + account_role_name = "TEST_ROLE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "USAGE",
        ]
      + with_grant_option = false

      + on_schema {
          + schema_name = "\"TEST_DB\".\"BUSINESS_DTV\""
        }
    }

  # snowflake_grant_privileges_to_account_role.schema_grant3 will be created
  + resource "snowflake_grant_privileges_to_account_role" "schema_grant3" {
      + account_role_name = "TEST_ROLE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "USAGE",
        ]
      + with_grant_option = false

      + on_schema {
          + schema_name = "\"TEST_DB\".\"INFO_DELIVERY\""
        }
    }

  # snowflake_grant_privileges_to_account_role.tables_grant will be created
  + resource "snowflake_grant_privileges_to_account_role" "tables_grant" {
      + account_role_name = "TEST_ROLE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "INSERT",
          + "SELECT",
        ]
      + with_grant_option = false

      + on_schema_object {
          + future {
              + in_database        = "TEST_DB"
              + object_type_plural = "TABLES"
            }
        }
    }

  # snowflake_role.role will be created
  + resource "snowflake_role" "role" {
      + fully_qualified_name = (known after apply)
      + id                   = (known after apply)
      + name                 = "TEST_ROLE"
      + show_output          = (known after apply)
    }

  # snowflake_schema.business_dtv will be created
  + resource "snowflake_schema" "business_dtv" {
      + catalog                                       = (known after apply)
      + data_retention_time_in_days                   = (known after apply)
      + database                                      = "TEST_DB"
      + default_ddl_collation                         = (known after apply)
      + describe_output                               = (known after apply)
      + enable_console_output                         = (known after apply)
      + external_volume                               = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + id                                            = (known after apply)
      + is_transient                                  = "default"
      + log_level                                     = (known after apply)
      + max_data_extension_time_in_days               = (known after apply)
      + name                                          = "BUSINESS_DTV"
      + parameters                                    = (known after apply)
      + pipe_execution_paused                         = (known after apply)
      + quoted_identifiers_ignore_case                = (known after apply)
      + replace_invalid_characters                    = (known after apply)
      + show_output                                   = (known after apply)
      + storage_serialization_policy                  = (known after apply)
      + suspend_task_after_num_failures               = (known after apply)
      + task_auto_retry_attempts                      = (known after apply)
      + trace_level                                   = (known after apply)
      + user_task_managed_initial_warehouse_size      = (known after apply)
      + user_task_minimum_trigger_interval_in_seconds = (known after apply)
      + user_task_timeout_ms                          = (known after apply)
      + with_managed_access                           = "false"
    }

  # snowflake_schema.info_delivery will be created
  + resource "snowflake_schema" "info_delivery" {
      + catalog                                       = (known after apply)
      + data_retention_time_in_days                   = (known after apply)
      + database                                      = "TEST_DB"
      + default_ddl_collation                         = (known after apply)
      + describe_output                               = (known after apply)
      + enable_console_output                         = (known after apply)
      + external_volume                               = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + id                                            = (known after apply)
      + is_transient                                  = "default"
      + log_level                                     = (known after apply)
      + max_data_extension_time_in_days               = (known after apply)
      + name                                          = "INFO_DELIVERY"
      + parameters                                    = (known after apply)
      + pipe_execution_paused                         = (known after apply)
      + quoted_identifiers_ignore_case                = (known after apply)
      + replace_invalid_characters                    = (known after apply)
      + show_output                                   = (known after apply)
      + storage_serialization_policy                  = (known after apply)
      + suspend_task_after_num_failures               = (known after apply)
      + task_auto_retry_attempts                      = (known after apply)
      + trace_level                                   = (known after apply)
      + user_task_managed_initial_warehouse_size      = (known after apply)
      + user_task_minimum_trigger_interval_in_seconds = (known after apply)
      + user_task_timeout_ms                          = (known after apply)
      + with_managed_access                           = "false"
    }

  # snowflake_schema.raw_dtv will be created
  + resource "snowflake_schema" "raw_dtv" {
      + catalog                                       = (known after apply)
      + data_retention_time_in_days                   = (known after apply)
      + database                                      = "TEST_DB"
      + default_ddl_collation                         = (known after apply)
      + describe_output                               = (known after apply)
      + enable_console_output                         = (known after apply)
      + external_volume                               = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + id                                            = (known after apply)
      + is_transient                                  = "default"
      + log_level                                     = (known after apply)
      + max_data_extension_time_in_days               = (known after apply)
      + name                                          = "RAW_DTV"
      + parameters                                    = (known after apply)
      + pipe_execution_paused                         = (known after apply)
      + quoted_identifiers_ignore_case                = (known after apply)
      + replace_invalid_characters                    = (known after apply)
      + show_output                                   = (known after apply)
      + storage_serialization_policy                  = (known after apply)
      + suspend_task_after_num_failures               = (known after apply)
      + task_auto_retry_attempts                      = (known after apply)
      + trace_level                                   = (known after apply)
      + user_task_managed_initial_warehouse_size      = (known after apply)
      + user_task_minimum_trigger_interval_in_seconds = (known after apply)
      + user_task_timeout_ms                          = (known after apply)
      + with_managed_access                           = "false"
    }

  # snowflake_schema.staging will be created
  + resource "snowflake_schema" "staging" {
      + catalog                                       = (known after apply)
      + data_retention_time_in_days                   = (known after apply)
      + database                                      = "TEST_DB"
      + default_ddl_collation                         = (known after apply)
      + describe_output                               = (known after apply)
      + enable_console_output                         = (known after apply)
      + external_volume                               = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + id                                            = (known after apply)
      + is_transient                                  = "default"
      + log_level                                     = (known after apply)
      + max_data_extension_time_in_days               = (known after apply)
      + name                                          = "STAGING"
      + parameters                                    = (known after apply)
      + pipe_execution_paused                         = (known after apply)
      + quoted_identifiers_ignore_case                = (known after apply)
      + replace_invalid_characters                    = (known after apply)
      + show_output                                   = (known after apply)
      + storage_serialization_policy                  = (known after apply)
      + suspend_task_after_num_failures               = (known after apply)
      + task_auto_retry_attempts                      = (known after apply)
      + trace_level                                   = (known after apply)
      + user_task_managed_initial_warehouse_size      = (known after apply)
      + user_task_minimum_trigger_interval_in_seconds = (known after apply)
      + user_task_timeout_ms                          = (known after apply)
      + with_managed_access                           = "false"
    }

  # snowflake_warehouse.warehouse will be created
  + resource "snowflake_warehouse" "warehouse" {
      + auto_resume                         = "default"
      + auto_suspend                        = 60
      + enable_query_acceleration           = "default"
      + fully_qualified_name                = (known after apply)
      + id                                  = (known after apply)
      + max_concurrency_level               = (known after apply)
      + name                                = "TEST_WH"
      + parameters                          = (known after apply)
      + query_acceleration_max_scale_factor = -1
      + show_output                         = (known after apply)
      + statement_queued_timeout_in_seconds = (known after apply)
      + statement_timeout_in_seconds        = (known after apply)
      + warehouse_size                      = "x-small"
    }

Plan: 14 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "SNOWFLAKE_USER" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-AywZzprwEEAaXfjx/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "SNOWFLAKE_ACCOUNT" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-AywZzprwEEAaXfjx/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│ 
│ In addition to the other similar warnings shown, 2 other variable(s)
│ defined without being declared.
╵
╷
│ Warning: Argument is deprecated
│ 
│   with provider["registry.terraform.io/snowflake-labs/snowflake"].security_admin,
│   on providers.tf line 1, in provider "snowflake":
│    1: provider "snowflake" {
│ 
│ Specify the region as part of the account parameter
│ 
│ (and 3 more similar warnings elsewhere)
╵
╷
│ Warning: Deprecated Resource
│ 
│   with snowflake_role.role,
│   on roles.tf line 1, in resource "snowflake_role" "role":
│    1: resource "snowflake_role" "role" {
│ 
│ This resource is deprecated and will be removed in a future major version
│ release. Please use snowflake_account_role instead.
│ 
│ (and one more similar warning elsewhere)
╵

```

</details>

*Pusher: @yassinedehbi, Action: `pull_request`, Working Directory: ``, Workflow: `Snowflake Terraform Workflow`*